In [3]:
import numpy as np
import pandas as pd 
from pandas import Series,DataFrame

In [5]:
df1 =DataFrame({'key':['x','y','z','x','y'],
                'data':range(5)})
df1

  key  data
0   x     0
1   y     1
2   z     2
3   x     3
4   y     4

In [21]:
df2 = DataFrame({'group_data':[10,20]},index=['x','y'])
df2

   group_data
x          10
y          20

In [23]:
pd.merge(df1,df2,left_on='key',right_index=True)

  key  data  group_data
0   x     0          10
1   y     1          20
3   x     3          10
4   y     4          20

In [27]:
df_hr = DataFrame({'key1':['in','sl','us','br','is'],
                  'key2':[10,20,30,20,10],
                  'data_set':np.arange(5.)})
df_hr

  key1  key2  data_set
0   in    10       0.0
1   sl    20       1.0
2   us    30       2.0
3   br    20       3.0
4   is    10       4.0

In [29]:
df1_hr = DataFrame(np.arange(10).reshape(5,2),
                    index=[['in','in','us','us','us'],
                          [20,10,20,20,10]],
                  columns=['col1','col2'])
df1_hr

       col1  col2
in 20     0     1
   10     2     3
us 20     4     5
   20     6     7
   10     8     9

In [31]:
pd.merge(df_hr,df1_hr,left_on=['key1','key2'],right_index=True)

  key1  key2  data_set  col1  col2
0   in    10       0.0     2     3

In [35]:
df1.join(df2)

  key  data  group_data
0   x     0         NaN
1   y     1         NaN
2   z     2         NaN
3   x     3         NaN
4   y     4         NaN